package lessons.lesson08.homework

//7. Все слова с большой буквы
//Напишите метод, который преобразует строку из нескольких слов в строку, где каждое слово начинается с заглавной буквы,
//а все остальные - строчные.
//Используй перебор, анализ символов и замену букв на заглавную с помощью метода uppercase() для конкретной буквы.
//fun example7() {
//    val string = "международная организация помощи борцам революции"
//    val words = string.split(" ")
//    var result = ""
//    for (word in words) {
//        result += word[0].uppercase() + word.substring(1).lowercase() + " "
//    }
//    println(result)
//}

//8. Игра в разведчика
//Напишите шифратор/дешифратор для строки.
//Шифровка производится путём замены двух соседних букв между собой: Kotlin шифруется в oKltni.
//Дешифровка выполняется аналогично.
//
//Если длина строки - нечётная, в конец добавляется символ пробела до начала шифрования.
//Таким образом все шифрованные сообщения будут с чётной длинной.
//Должно получиться два публичных метода: encrypt() и decrypt() которые принимают строку и печатают результат в консоль.

//fun example8() {
//    var string = "международная организация помощи борцам революции"
//    var result = ""
//
//    if (string.length % 2 != 0) {
//        string += " "
//    }
//    for (i in 0 until string.length step 2) {
//        val first = string[i]
//        val second = string[i + 1]
//
//        result += second.toString() + first.toString()
//    }
//
//    println(result)
//}