package lessons.lesson11.homework

fun main() {


//===========Задачи на сигнатуру метода============
//Напишите сигнатуру метода в которую входит модификатор доступа, название функции, список аргументов с типами и возвращаемое значение. В теле метода можешь сделать возврат объекта нужного типа если это требуется для устранения ошибок.

    //1. Не принимает аргументов и не возвращает значения.
    fun task1(): Unit

    //2. Принимает два целых числа и возвращает их сумму.
    fun task2(a: Int, b: Int): Int

    //3. Принимает строку и ничего не возвращает.
    fun task3(text: String): Unit

    //4. Принимает список целых чисел и возвращает среднее значение типа Double.
    fun task4(numbers: List<Int>): Double

    //5. Принимает nullable строку и возвращает её длину в виде nullable целого числа и доступна только в текущем файле.
    private fun task5(text: String?): Int?

    //6. Не принимает аргументов и возвращает nullable вещественное число.
    fun task6(): Double?

    //7. Принимает nullable список целых чисел, не возвращает значения и доступна только в текущем файле.
    private fun task7(numbers: List<Int>?): Unit

    //8. Принимает целое число и возвращает nullable строку.
    fun task8(number: Int): String?

    //9. Не принимает аргументов и возвращает список nullable строк.
    fun task9(): List<String?>

    //10. Принимает nullable строку и nullable целое число и возвращает nullable булево значение.
    fun task10(text: String?, number: Int?): Boolean?

    //============Задачи на написание кода==============
//Напишите валидную сигнатуру метода а так же рабочий код для задач.
    fun sum(a: Int, b: Int): Int = a + b

    //Напишите функцию multiplyByTwo, которая принимает целое число и возвращает его, умноженное на 2.
    fun multiplyByTwo(number: Int): Int = number * 2

    //Создайте функцию isEven, которая принимает целое число и возвращает true, если число чётное, и false в противном случае.
    fun isEven(number: Int): Boolean = number % 2 == 0

    //Напишите функцию printNumbersUntil, которая принимает целое число n и выводит на экран числа от 1 до n.
// Если число n меньше 1, функция должна прекратить выполнение с помощью return без вывода сообщений.
    fun printNumbersUntil(n: Int) {
        if (n < 1) {
            return
        }
        for (i in 1..n) { //перебирает числа от 1 до n включительно.
            println(i) //выводит текущее число
        }
    }


    //Создайте функцию findFirstNegative, которая принимает список целых чисел и возвращает первое отрицательное число в списке.
// Если отрицательных чисел нет, функция должна вернуть null.
    fun findFirstNegative(numbers: List<Int>): Int? {
        for (n in numbers) {
            if (n < 0) return n
        }
        return null
    }

    //Напишите функцию processList, которая принимает список строк. Функция должна проходить по списку и выводить каждую строку.
// Если встречается null значение, функция должна прекратить выполнение с помощью return без возврата значения.
    fun processList(numbers: List<String?>): Unit {
        for (d in numbers) {
            if (d == null)
                return
            println(d)
        }
    }
}