package lessons.lesson12.homework

val numbers = listOf(-1, 2, -3, -1, 4, 4, 5, -5, 8, 18, 22, 37, 264)
val nullableList = listOf("Кот", null, "Пёс", null, "Лиса")
val grades = listOf(85, 58, 90, 74, 88, 67, 95, 92, 50, 42, 12)
val list = listOf(
    "Стол", "табурет", "ваза", "Кружка", "Зеркало", "ковер", "Шкаф", "часы", "Люстра", "подушка", "Картина",
    "столик", "Вазон", "шторы", "Пуф", "книга", "Фоторамка", "светильник", "Коврик", "вешалка", "Подставка", "телевизор",
    "Комод", "полка", "Абажур", "диван", "Кресло", "занавеска", "Бра", "пепельница", "Глобус", "статуэтка",
    "Поднос", "фигурка", "Ключница", "плед", "Тумба", "игрушка", "Настенные часы", "подсвечник", "Журнальный столик",
    "сувенир", "Корзина для белья", "посуда", "Настольная лампа", "торшер", "Этажерка")

fun main() {
    println(task(numbers))
    println(task1(grades))
    println(task2(list))
    println(task3(list))
    println(task4(numbers))

    val ages = listOf(22, 18, 30, 45, 17, null, 60)
    println(task5(ages, 18))


//============Задачи на приведение коллекции к значению============
//1.Проверить, что размер коллекции больше 5 элементов.
    println(numbers.size > 5)
//2.Проверить, что коллекция пустая
    println(numbers.isEmpty())
//3.Проверить, что коллекция не пустая
    println(numbers.isNotEmpty())
//4.Взять элемент по индексу или создать значение если индекса не существует
    val elementOrElse = numbers.getOrElse(10) { -100500 }
    println("Полученный элемент: $elementOrElse")
//5.Собрать коллекцию в строку
    println(numbers.joinToString(" "))
//6.Посчитать сумму всех значений
    println(numbers.sum())
//7.Посчитать среднее
    println(numbers.average())
//8.Взять максимальное число
    println(numbers.maxOrNull())
//9.Взять минимальное число
    println(numbers.minOrNull())
//10.Взять первое число или null
    println(numbers.firstOrNull())
//11.Проверить что коллекция содержит элемент
    println(numbers.contains(-1))

//============Задачи на обработку коллекций============
//12.Отфильтровать коллекцию по диапазону 18-30
    println(numbers.filter { it in 18..30 })
//13.Выбрать числа, которые не делятся на 2 и 3 одновременно
    println(numbers.filterNot { it % 2 == 0 && it % 3 == 0 })
//14.Очистить текстовую коллекцию от null элементов
    println(nullableList.filterNotNull())
//15.Преобразовать текстовую коллекцию в коллекцию длин слов
    println(nullableList.map { it?.length ?: 0 })
//16.Преобразовать текстовую коллекцию в мапу, где ключи - перевёрнутые слова, а значения - длина слов
    println(nullableList.filterNotNull().associate { it.reversed() to it.length })
//17.Отсортировать список в алфавитном порядке
    println(nullableList.filterNotNull().sorted())
//18.Взять первые 3 элемента списка
    println(numbers.take(3))
//19.Распечатать квадраты элементов списка
    numbers.forEach { println(it * it) }
//20.Группировать список по первой букве слов
    println(nullableList.filterNotNull().groupBy { it[0] })
//21.Очистить список от дублей
    println(numbers.distinct())
//22.Отсортировать список по убыванию
    println(numbers.sortedDescending())
//23.Взять последние 3 элемента списка
    println(numbers.takeLast(3))
}

//============Задача 24. Характеристика числовой коллекции============
//Напиши функцию, которая принимает коллекцию чисел и
//возвращает строку с характеристикой коллекции используя конструкцию when
//Если коллекция пустая - “Пусто” --
//Если количество элементов меньше пяти - “Короткая” --
//Если коллекция начинается с 0 - “Стартовая” --
//Если сумма всех чисел больше 10000 - “Массивная”
//Если среднее значение равно 10 - “Сбалансированная”
//Если длина строки образованная склеиванием коллекции в строку равна 20 - “Клейкая”
//Если максимальное число меньше -10 - “Отрицательная”
//Если минимальное число больше 1000 - “Положительная”
//Если содержит одновременно числа 3 и 14 - “Пи***тая”
//Иначе - “Уникальная”
//Вызвать метод с данными, подходящими под каждую из веток

fun task(numbers: List<Int>): String {
    return when {
        numbers.isEmpty() -> "Пусто"
        numbers.size < 5 -> "Короткая"
        numbers.firstOrNull() == 0 -> "Стартовая"
        numbers.sum() > 10000 -> "Массивная"
        numbers.average() == 10.0 -> "Сбалансированная"
        numbers.joinToString("").length == 20 -> "Клейкая"
        (numbers.maxOrNull() ?: 0) < -10 -> "Отрицательная"
        (numbers.minOrNull() ?: 0) > 1000 -> "Положительная"
        numbers.contains(3) && numbers.contains(14) -> "Пи***тая"
        else -> "Уникальная"
    }
}

//============Задача 25. Анализ учебных оценок============
//Напиши функцию, которая принимает список чисел и возвращает список чисел.
//Пример данных: val grades = listOf(85, 58, 90, 74, 88, 67, 95, 92, 50, 42, 12)
//Цель: Отфильтровать удовлетворительные оценки (>=60), отсортировать оставшиеся по возрастанию и взять первые 3.
//Вызывай методы обработки и фильтрации последовательно один из другого,
//чтобы результат предыдущего метода являлся основой для следующего.

fun task1(grades: List<Int>): List<Int> {
    return grades
        .filter { it >= 60 }
        .sorted()
        .take(3)
}


//============Задача 26. Создание каталога по первой букве============
//Напиши функцию, которая принимает список строк и возвращает словарь с ключом - буквой и значением - списком строк.
//Начальные значения: val list = listOf( "Стол", "табурет", "ваза", "Кружка", "Зеркало", "ковер", "Шкаф", "часы",
// "Люстра", "подушка", "Картина", "столик", "Вазон", "шторы", "Пуф", "книга", "Фоторамка", "светильник", "Коврик", "вешалка",
// "Подставка", "телевизор", "Комод", "полка", "Абажур", "диван", "Кресло", "занавеска", "Бра", "пепельница", "Глобус", "статуэтка", "Поднос", "фигурка", "Ключница", "плед", "Тумба", "игрушка", "Настенные часы", "подсвечник", "Журнальный столик", "сувенир",
// "Корзина для белья", "посуда", "Настольная лампа", "торшер", "Этажерка" )
//Цель: Привести все слова в списке к нижнему регистру, сгруппировать в каталог по первой букве используя метод groupBy

fun task2(list: List<String>): Map<Char, List<String>> {
    return list
        .map { it.lowercase() }
        .groupBy { it[0] }
}

//============Задание 27. Подсчёт средней длины слов в списке============
//Напиши функцию, которая принимает список строк и возвращает строку.
//Начальные значения взять из предыдущей задачи.
//Цель: Перевести все слова в количество букв, подсчитать среднее значение.
//Вернуть форматированный текст с двумя знаками после запятой, используя функцию format и подходящий шаблон.

fun task3(list: List<String>): String {
    return "%.2f".format(
        list.map { it.length }.average()
    )
}

//============Задание 28: Категоризация чисел============
//Напиши функцию, которая принимает список чисел и возвращает словарь с ключами - строками и значениями - список чисел.
//Начальные значения: val numbers = listOf(1, 3, 5, 7, 3, 1, 8, 9, 9, 7)
//Цель: Отобрать уникальные числа, отсортировать по убыванию и сгруппировать по четности (“четные” и “нечетные”).

fun task4(numbers: List<Int>): Map<String, List<Int>> {
    return numbers
        .distinct()
        .sortedDescending()
        .groupBy {
            if (it % 2 == 0) "четные" else "нечетные"
        }
}

//============Задание 29: Поиск первого подходящего элемента============
//Напиши функцию, которая принимает список чисел и число и возвращает nullable число.
//Начальные значения: val ages = listOf(22, 18, 30, 45, 17, null, 60) и число для проверки возраста, например 18.
//Цель: Найти первый возраст в списке, который соответствует условию (больше второго аргумента) и вернуть его,
// либо null если значения не нашлось.

fun task5(ages: List<Int?>, age: Int): Int? {
    return ages
        .filterNotNull()
        .firstOrNull { it > age }
}
